Tekla Open API Reference for Tekla Structures 2025
TaskWorktype.Name Property
 The name of the task worktype.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
TaskWorktype Class
Tekla.Structures.Model Namespace